Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.Type
The Type class represents the type filter expression.

Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.Type.#ctor
Initializes a new instance of the Type class.